////////////////////////////////////////////////////////////////
// секция форвард-декларации
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
// секция заголовочного файла
////////////////////////////////////////////////////////////////
#include "wvk_commands_global_test.h"
////////////////////////////////////////////////////////////////
// секция имплементации
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
// секция для остального
////////////////////////////////////////////////////////////////

namespace CGDev {

	namespace tests {

		// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		// Тест: Успешное создание, когда log и vkn_loader заданы
		// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		TEST_F(WvkCommandsGlobalTest, Create_WithLoader_Succeeds) {

			//auto status = s_vkn_commands_global_level.create(&s_vkn_commands_create_info);

			//EXPECT_EQ(status.isOk(), true);
		}

		// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		// Тест: Нельзя создать без загрузчика Vulkan (vkn_loader = nullptr)
		// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		TEST_F(WvkCommandsGlobalTest, Create_FailsWhenVknLoaderIsNull) {

			//s_vkn_commands_create_info.wvk_loader = nullptr;

			//auto status = s_vkn_commands_global_level.create(&s_vkn_commands_create_info);

			//EXPECT_NE(status.isOk(), true);
		}
	} // namespace tests
} // namespace CGDev