// SPDX-License-Identifier: None
// Copyright (c) 2026 None

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
///
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
pub type DHIError = crate::common::Error<DHIErrorType>;

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
///
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
pub enum DHIErrorType {
    /// ошибка создания контектста
    DHI_CONTEXT_CREATE_FAILED,
    /// ошибка создания бэкенд контекста
    DHI_BACKEND_CONTEXT_CREATE_FAILED,
}
